package days03;

/**
 * @author user
 * @date 2024. 1. 3. 오후 3:28:32
 * @subject
 * @contents
 */
public class Ex05 {
	public static void main(String[] args) {
		/*[연산자 우선 순위]
		 * 1)단항연산자 <-(오른쪽에서 왼쪽으로) 후위형이 오른쪽에 있고 전위형이 왼쪽에 있으면?? 
		 *  ~ ! (cast)
		 *  2)산술연산자
		 *   ㄱ.* / %
		 *   ㄴ. + -
		 *    [비트] 시프트 연산자 >> << -> 쓸일이 별로없음
		 *   3) 비교연산자
		 *   > < >= <= instanceof 
		 *   == !=
		 *   4)논리연산자
		 *   &
		 *   ^
		 *   |
		 *   &&
		 *   ||
		 *   5)삼항(조건)연산자 연산 순서 <-(오른쪽에서 왼쪽으로)
		 *   	항1 ? 항2: 항3
		 *   6) 대입연산자 <-(오른쪽에서 왼쪽으로)
		 *     	=  <-
		 *     	복합대입연산자
		 *     	+= -= /= %= &= |= ^= >>= <<= *= 등등
		 *     	n/=2 n = n/2
		 *     	n%=2 n = n%2
		 *    
		 */
				
	}

}
