package days15;

public class Ex00 {
	/*1. 용어 정리
	  1) 객체 지향적 프로그래밍( OOP ) 
	  2) 객체  : 클래스 내에 실재하는 것      
	  3) 클래스      
	  4) 인스턴스      
	  5) 인스턴스화
	  6) 객체의 구성요소 
	  7) 멤버 
	  8) 멤버변수
	  9) 멤버함수 
	  10) 필드
	  11) 메서드 
	  12) 변수    : 메모리 상의 값을 저장하는 기억공간 ,값을 여러번 할당할 수 있는 기억공간. String name= "홍길동"; ...   
	  13) 참조변수	
	  
	2. 클래스의 특징( OOP의 특징 )에 대해서 설명하세요.
	   
	3. 클래스의 설계 과정에 대해서 설명하세요.  
	   
	4. 클래스의 [멤버(필드, 메서드, 생성자 )]를 접근하는 방법에 대해서 설명하세요.
	    
	5. NullPointerException 예외(에러)는 언제 발생하는 가 ?
	  
	6. 클래스의 선언 형식
	  
	7. 클래스 앞의 접근지정자의 종류에 대해서 설명하세요.
	   
	8. 멤버 앞의 접근지정자의 종류에 대해서 설명하세요.
	   
	9. 클래스 선언할 때 기타제어자 종류에 대해서 설명하세요.
	   
	10. 클래스(객체) 복사(copy)와 복제(clone)에 대해서 설명하세요.
	
	11. 클래스 배열( 객체 배열 ) 에 대해서 설명하세요.
	
	12. 선언되는 위치를 기준으로 변수 구분하고, 생성시기, 소멸시기에 대해서 설명하세요. 
	    
	13. 30명 학생의 성적 처리
	   ( Student 클래스 선언 후 사용 ) 
	 */

}
