package days02;

/**
 * @author user
 * @date 2024. 1. 2. 오후 4:46:52
 * @subject
 * @contents
 */
public class Ex11 {
	public static void main(String[] args) {
		// 실수형 : float(4) , double(8)
		// 정수형 : int(4) , long(8)
		float f; // 32비트 [부호비트 1,0][8비트 지수(E) 1000 0010][23가수][][][][][] *4
		double d ; // 64비트 [부호비트 1,0][11비트 지수(E)][52가수][][][][][]*8
		
		// 9.1234567 실수 (10진수) - > 2진수 실수 변환 -> 정규화 -> 저장.
		// 1001. 00011011101110100100111... (무한실수)
		// 정규화 (부동소수점)
		// 1.00100011111001010101010101... *2^3(무한실수)
		//    가수(M)                         지수 (E)
	}

}
